jackeyjiang/STM32_DGUS/STM32_Demo/utilities/network_handle/network_handle.c
#include "stm32f4xx.h"
#include "uart5.h"
#include "network_handle.h"
#include "printer.h"
#include "delay.h"
#include "rtc.h"
#include "stdio.h"
#include "MsgHandle.h"



static long Batch = 0x00 ;//交易流水号  	

unsigned char  TID[7] = {0xa2,0x00,0x04,0x10,0x00,0x00,0x04}; /*终端TID码 10000004*/
unsigned char  BRWN[7+3] = {0xa6,0x00,0x07,0x00,0x00,0x00,0x00,0x00,0x00,0x00};	 /*交易流水线*/
unsigned char  BNO[6] = {0xa7,0x00,0x03,0x00,0x00,0x00};               /*批次号*/
unsigned char  DeviceArea[3+3]={0xac,0x00,0x03,0x17,0x03,0x01};         /*终端所在区域编号*/
unsigned char  DeviceAreaNO[4+3]={0xad,0x00,0x04,0x17,0x03,0x01,0x06};   /*终端所在地域编号*/  
unsigned char  DeviceStatus[2+3]={0xae,0x00,0x02,'0','0'};	   /*终端状态*/
unsigned char  DealData[7]={0xa9,0x00,0x04,0x00,0x00,0x00,0x00};       /*交易日期*/
unsigned char  DealTime[6]={0xaa,0x00,0x03,0x00,0x00,0x00};       /*交易时间*/   
unsigned char  MAC[8+3]={0xc9,0x00,0x08,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00};   /*MAC*/
unsigned char  DealBalance[6+3]={0xb0,0x00,0x06,0x00,0x00,0x00,0x00,0x00,0x00};    /*交易金额*/
unsigned char  MealID[4+3] = {0xb1,0x00,0x04,0x10,0x00,0x00,0x20} ;                /*餐品ID  10000020*/
unsigned char  MealNO[1+3] = {0xb2,0x00,0x01,0x00};		   /*餐品购买数量*/
unsigned char  MealName[20+3] ={0xb3,0x00,0x14,'a','b','c','d','e','a','b','c','d','e','a','b','c','d','e','a','b','c','d','a'};  /*餐品名字*/
unsigned char  MealPrice[6+3]={0xbd,0x00,0x06,0x00,0x00,0x00,0x00,0x00,0x00};	  /*餐品价格*/
unsigned char  PayType[1+3]={0xbf,0x00,0x01,0x00};        /*支付方式*/
unsigned char  Change[6+3]={0xd7,0x00,0x06,0x00,0x00,0x00,0x00,0x00,0x00} ;        /*找零金额*/
unsigned char  RemainMealNum[2+3]={0xd8,0x00,0x02,0x00,0x00};  /*剩余餐品数量*/
unsigned char  MName[20+3]={0xa4,0x00,0x14,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x01};             /*商户号MID*/
unsigned char  APPVersion[8+3]={ 0xc2,0x00,0x08,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x01};       /*应用程序版本*/
unsigned char  ParaFileVersion[8+3]={0xc3,0x00,0x08,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x01};  /*参数文件版本*/ 
unsigned char  BDataFileVersion[8+3]={0xc4,0x00,0x08,0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x01};	/*业务数据文件版本*/ 
unsigned char  ChechStatus[2+3]={0xab,0x00,0x02,0x00,0x00};                                     /*自检状态*/
unsigned char  MID[3+3]={ 0xa3,0x00,0x03,0x10,0x00,0x01};                                       /*商户号MID*/
unsigned char  TTCount[3+2]     ={0xb7,0x00,0x02,0x00,0x00};	                                            /*交易总笔数 */
unsigned char  TNCT[6+3]        ={0xb8,0x00,0x06,0x00,0x00,0x00,0x00,0x00,0x00};                            /*交易总金额*/
unsigned char  TNtype[3+2]      ={0xd9,0x00,0x02,0x00,0x00};											    /*交易总产品数 d9*/
unsigned char  TotalChange[3+6] ={0xd7,0x00,0x06,0x00,0x00,0x00,0x00,0x00,0x00};							/*总找零金额 d7*/
	
unsigned char  UpdataFlag[4];
unsigned char  ACK[4];  //这个是什么?
unsigned char  WordKeyCipher[11];
Meal_struction Meal[9]={
	                        /*餐品ID*/				/*餐品名字*/  	       /*餐品数量*/	     /*餐品价格*/			  /*餐品类型*/
							      0x10,0x00,0x00,0x20,  {"红萝卜炒蛋          "}, 0x00,0xc8,      0x00,0x00,0x15,0x00,	   {"C005"},
							      0x10,0x00,0x00,0x21,  {"菜脯煎蛋            "}, 0x00,0x00,      0x00,0x00,0x15,0x00,	   {"C005"},
							      0x10,0x00,0x00,0x22,  {"土豆牛腩            "}, 0x00,0x00,      0x00,0x00,0x15,0x00,	   {"C005"},
							      0x10,0x00,0x00,0x23,  {"香菇滑鸡            "}, 0x00,0x00,      0x00,0x00,0x20,0x00,	   {"C005"},
							      0x10,0x00,0x00,0x24,  {"红烧鱼块            "}, 0x00,0x00,      0x00,0x00,0x20,0x00,	   {"C005"},
							      0x10,0x00,0x00,0x25,  {"咖喱土鸡            "}, 0x00,0x00,      0x00,0x00,0x20,0x00,	   {"C005"},
							      0x10,0x00,0x00,0x26,  {"脆皮烧鸭            "}, 0x00,0x00,      0x00,0x00,0x25,0x00,	   {"C005"},
							      0x10,0x00,0x00,0x27,  {"梅菜扣肉            "}, 0x00,0x00,      0x00,0x00,0x25,0x00,	   {"C005"},
							      0x10,0x00,0x00,0x28,  {"秘制叉烧            "}, 0x00,0x00,      0x00,0x00,0x25,0x00,	   {"C005"},	
	                      };
 
 /******************************/
 unsigned char	Record_buffer[1024] = {0} ;  
 unsigned char	Temple_Data[20]={0};  
 unsigned char data_null[]={"  "};
 unsigned char data_hche[]={"\r\n"};
 unsigned char tim1[]={"-"};
 unsigned char tim2[]={" "};
 
 /******************************/
 unsigned char data_LS1[]={"交"};
 unsigned char data_LS2[]={"易"};
 unsigned char data_LS3[]={"流"};
 unsigned char data_LS4[]={"水"};
 unsigned char data_LS5[]={"号"};
 unsigned char data_LS6[]={":"};
 /******************************/
 unsigned char data_ID1[]={"餐"};
 unsigned char data_ID2[]={"品"};
 unsigned char data_ID3[]={"编"};
 unsigned char data_ID4[]={"号"};
 /******************************/
 unsigned char data_NB1[]={"销"};
 unsigned char data_NB2[]={"售"};
 unsigned char data_NB3[]={"数"};
 unsigned char data_NB4[]={"量"};
 /******************************/
 unsigned char data_PR1[]={"餐"};
 unsigned char data_PR2[]={"品"};
 unsigned char data_PR3[]={"价"};
 unsigned char data_PR4[]={"格"};
 /******************************/
 unsigned char data_PS1[]={"支"};
 unsigned char data_PS2[]={"付"};
 unsigned char data_PS3[]={"方"};
 unsigned char data_PS4[]={"式"};
 
 unsigned char data_PS5[]={"现"};
 unsigned char data_PS6[]={"金"};
 
 unsigned char data_PS7[]={"银"};
 unsigned char data_PS8[]={"联"};
 unsigned char data_PS9[]={"卡"};
 unsigned char data_PS10[]={"深"};
 unsigned char data_PS11[]={"圳"};
 unsigned char data_PS12[]={"通"};
 unsigned char data_PS13[]={"IC"};
 unsigned char data_PS14[]={"卡"};
 
 
 /******************************/
 unsigned char data_ZL1[]={"找"};
 unsigned char data_ZL2[]={"零"};
 unsigned char data_ZL3[]={"金"};
 unsigned char data_ZL4[]={"额"};
 /******************************/
 unsigned char data_SY1[]={"剩"};
 unsigned char data_SY2[]={"余"};
 unsigned char data_SY3[]={"数"};
 unsigned char data_SY4[]={"量"};
 /******************************/
 unsigned char data_TM1[]={"交"};
 unsigned char data_TM2[]={"易"};
 unsigned char data_TM3[]={"时"};
 unsigned char data_TM4[]={"间"};
 /******************************/


