jackeyjiang/STM32_DGUS/STM32_Demo/utilities/network_handle/network_handle.c
  CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],MealPrice,sizeof(MealPrice));          /*餐品价格*/	
   /*付钱的方式*/
	PayType[3] = CustomerSel.PayType ;										
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],PayType,sizeof(PayType));              /*支付方式*/
	/*找零金额*/
	for(i=0;i<6;i++)
	Change[3+i] = CustomerSel.Change[i] ;	    
  CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],Change,sizeof(Change));                /*找零金额*/
	/*剩余餐品数量*/
	for(i=0;i<2;i++)
	{
    RemainMealNum[3+i] = CustomerSel.RemainMealNum[i] ;
//	 printf("CustomerSel.RemainMealNum[i]=%d\r\n",CustomerSel.RemainMealNum[i]);
	}
 	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],RemainMealNum,sizeof(RemainMealNum));  /*剩余餐品数量*/			 
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],MAC,sizeof(MAC));                      /*MAC*/
//  if(UserAct.PayType == '2' )	                                                                       /* 表示如果是刷卡*/
//	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],STATUS.PacketData,STATUS.DataLength-17);                /*记录刷卡信息*/
//	if(UserAct.PayType == '3')
//  CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],STATUS.PacketData,STATUS.DataLength-17);                /*记录刷卡信息*/		
	Send_Buf[CmdLenght] = 0x03 	;
	CmdLenght+=0x03;	
	                                
  i = MealComparefunDemo(0x0800,Send_Buf,CmdLenght);
  mem_copy00(SendBuffer, Send_Buf,CmdLenght);
	
	HL_IntToBuffer(CmdLenght,&SendBuffer[1019]);   /*保存数据的长度*/
	if(i == 0x01) /*判断是否超时*/
	return 1 ;	 
  Lenght = HL_BufferToInit(&rx1Buf[2]) ;
	if(Lenght == 0x00)/*判断数据长度*/
	return 1 ;
	for(j=0;j<Lenght+7;j++)
	{ 
//	printf("rx1Buf[%d]=%x\r\n",j,rx1Buf[j]);
	}
	if(rx1Buf[0]==0x07 && rx1Buf[1]==0x10)	 //表示正确
	{  	
		if(rx1Buf[7]==0x00)/*是否应答命令*/
		{
		  return 0 ;
		}
		if(rx1Buf[7]==0x24)/*交易流水号（终端流水）重复*/
		{
//    Batch ++ ;   /*流水号自加*/
      return 1 ;
		} 
	}
  return 0 ;
}



 /*******************************************************************************
* Function Name  : MealUploadingFun		 0X0300
* Description    : 餐品上送
* Input          : void
* Output         : void
* Return         : void	  
*******************************************************************************/
unsigned char MealUploadingFun(void)
{
  unsigned char i = 0 ;
	long  Lenght = 0 ,j=0;
	unsigned char 	  Send_Buf[400];
	long  CmdLenght = 0 ;	 
	/*接受缓冲区清0*/
	mem_set_00(rx1Buf,sizeof(rx1Buf));
	/*水流号++*/
	Send_Buf[0] =  0x02 ;
	Send_Buf[1] =  0x00 ;
	Send_Buf[2] =  0x00 ;
	Send_Buf[3] =  0x00 ;
	Send_Buf[4] =  0x00 ;
	CmdLenght = 5 ;
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],TID,sizeof(TID));  /*终端的TID*/

	BRWN[3] =  Batch /1000000000000 ;
	BRWN[3] =  BRWN[3] /10 *16 + BRWN[3]%10 ;
	BRWN[4] =	 Batch /10000000000 %100 ;
	BRWN[4] =  BRWN[4] /10 *16 + BRWN[4]%10 ;
	BRWN[5] =	 Batch /100000000%100;
	BRWN[5] =  BRWN[5] /10 *16 + BRWN[5]%10 ;
	BRWN[6] =	 Batch /1000000%100;
	BRWN[6] =  BRWN[6] /10 *16 + BRWN[6]%10 ;
	BRWN[7] =	 Batch /10000 %100 ;
	BRWN[7] =  BRWN[7] /10 *16 + BRWN[7]%10 ;
	BRWN[8] =	 Batch/100 %100;
	BRWN[8] =  BRWN[8] /10 *16 + BRWN[8]%10 ;
	BRWN[9] =	 Batch %100;
	BRWN[9] =  BRWN[9] /10 *16 + BRWN[9]%10 ;
	
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],BRWN,sizeof(BRWN));  /*流水号*/
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],BNO,sizeof(BNO));  /*批次号*/
  CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],DeviceArea,sizeof(DeviceArea));  /*终端所在区域编号*/
	CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],DeviceAreaNO,sizeof(DeviceAreaNO)); /*终端所在地域编号*/
	 /*
	  这里添加没有上传的产品名字
	 */
  CmdLenght +=mem_copy00(&Send_Buf[CmdLenght],MAC,sizeof(MAC)); /*MAC*/
	Send_Buf[CmdLenght] = 0x03 	;
	CmdLenght+=0x03;
	i = MealComparefunDemo(0x0400,Send_Buf,CmdLenght);
	if(i == 0x01)
	  return 1 ;
  Lenght = HL_BufferToInit(&rx1Buf[2]) ;
	for(j=0;j<Lenght+7;j++)
	{
//	printf("rx1Buf[%d]=%x\r\n",j,rx1Buf[j]);
	}
	return 0 ;
 }



 /*******************************************************************************
* Function Name  : MealGroupUploadingFun		 披上送
* Description    : 餐品披上送
* Input          : void
* Output         : void
* Return         : void	  
*******************************************************************************/

typedef struct 
{
  unsigned char  BRWN[3];           /*交易流水线*/
  unsigned char  MealID[4];         /*餐品ID*/
  unsigned char  DealBalance[6];    /*交易金额*/
  unsigned char  MealNO;		    /*餐品购买数量*/
  unsigned char	 RemainMealNum[2];  /*剩余餐品数量*/
  unsigned char  MealPrice[6];	    /*餐品价格*/
  unsigned char  PayType;           /*支付方式*/
  unsigned char  Change[6];         /*找零金额*/
  unsigned char  TimeData[7];		/*购买的时间*/
}MealGroup_struction;
 MealGroup_struction 	 MealGroup[9]={		/*交易流水线*/ /*餐品ID*/		  /*交易金额*/            /*餐品购买数量*/    /*剩余餐品数量*/		/*餐品价格*/	  /*支付方式*/			/*找零金额*/			  /*购买的时间*/
                                         {0x00,0x00,0x01, 0x10,0x00,0x00,0x20, 0x00,0x00,0x00,0x00,0x00,0x00,  0x00,   0x00,0x00,   0x00,0x00,0x00,0x00,0x15,0x00,  0x00,  0x00,0x00,0x00,0x00,0x00,0x00,  0x00,0x00,0x00,0x00,0x00,0x00,0x00},
                                       	 {0x00,0x00,0x02, 0x10,0x00,0x00,0x21, 0x00,0x00,0x00,0x00,0x00,0x00,  0x00,    0x00,0x00,  0x00,0x00,0x00,0x00,0x15,0x00,  0x00,  0x00,0x00,0x00,0x00,0x00,0x00,  0x00,0x00,0x00,0x00,0x00,0x00,0x00},
										 {0x00,0x00,0x03, 0x10,0x00,0x00,0x22, 0x00,0x00,0x00,0x00,0x00,0x00,  0x00,    0x00,0x00,  0x00,0x00,0x00,0x00,0x15,0x00,  0x00,  0x00,0x00,0x00,0x00,0x00,0x00,  0x00,0x00,0x00,0x00,0x00,0x00,0x00},
										 {0x00,0x00,0x04, 0x10,0x00,0x00,0x23, 0x00,0x00,0x00,0x00,0x00,0x00,  0x00,    0x00,0x00,  0x00,0x00,0x00,0x00,0x20,0x00,  0x00,  0x00,0x00,0x00,0x00,0x00,0x00,  0x00,0x00,0x00,0x00,0x00,0x00,0x00},
										 {0x00,0x00,0x05, 0x10,0x00,0x00,0x24, 0x00,0x00,0x00,0x00,0x00,0x00,  0x00,    0x00,0x00,  0x00,0x00,0x00,0x00,0x20,0x00,  0x00,  0x00,0x00,0x00,0x00,0x00,0x00,  0x00,0x00,0x00,0x00,0x00,0x00,0x00},
										 {0x00,0x00,0x06, 0x10,0x00,0x00,0x25, 0x00,0x00,0x00,0x00,0x00,0x00,  0x00,    0x00,0x00,  0x00,0x00,0x00,0x00,0x20,0x00,  0x00,  0x00,0x00,0x00,0x00,0x00,0x00,  0x00,0x00,0x00,0x00,0x00,0x00,0x00},
										 {0x00,0x00,0x07, 0x10,0x00,0x00,0x26, 0x00,0x00,0x00,0x00,0x00,0x00,  0x00,    0x00,0x00,  0x00,0x00,0x00,0x00,0x25,0x00,  0x00,  0x00,0x00,0x00,0x00,0x00,0x00,  0x00,0x00,0x00,0x00,0x00,0x00,0x00},
										 {0x00,0x00,0x08, 0x10,0x00,0x00,0x27, 0x00,0x00,0x00,0x00,0x00,0x00,  0x00,    0x00,0x00,  0x00,0x00,0x00,0x00,0x25,0x00,  0x00,  0x00,0x00,0x00,0x00,0x00,0x00,  0x00,0x00,0x00,0x00,0x00,0x00,0x00},
										 {0x00,0x00,0x09, 0x10,0x00,0x00,0x28, 0x00,0x00,0x00,0x00,0x00,0x00,  0x00,    0x00,0x00,  0x00,0x00,0x00,0x00,0x25,0x00,  0x00,  0x00,0x00,0x00,0x00,0x00,0x00,  0x00,0x00,0x00,0x00,0x00,0x00,0x00},
									    };

void StructCopyToBuffer00(unsigned char *dest,unsigned char index)
{

  long i=0,k=0;
  for(i=0;i<3;i++)
	{		 
	  dest[k++]=MealGroup[index].BRWN[i];
	}
	for(i=0;i<4;i++)
	{
	  dest[k++]=MealGroup[index].MealID[i];
	}
	for(i=0;i<6;i++)
	{
	  dest[k++]=MealGroup[index].DealBalance[i];
	}
	dest[k++]=MealGroup[index].MealNO;
	for(i=0;i<2;i++)
	{
	   dest[k++]=MealGroup[index].RemainMealNum[i];
	}   
	for(i=0;i<6;i++)
	dest[k++]=MealGroup[index].MealPrice[i];
	dest[k++]=MealGroup[index].PayType;
	if(MealGroup[index].PayType==0x01)
	{
	  for(i=0;i<4;i++)
	  dest[k++]=MealGroup[index].Change[i];
	}
 	for(i=0;i<6;i++)
	dest[k++]=MealGroup[index].TimeData[i];
}

