jackeyjiang/STM32_DGUS/STM32_Demo/utilities/network_handle/network_handle.c
unsigned char 	Resend(unsigned char *p,long lenght)
{
	unsigned char Waittimeout = 100 ;
	long Lenght,j;
	mem_set_00(rx1Buf,sizeof(rx1Buf));
	CmdDataSend(p,lenght);	//发送数据
  /*等待数据返回*/
  while(--Waittimeout)
	{
		delay_ms(10);
		if(F_RX1_Right)
		{
		  F_RX1_Right = 0 ;
		  break;
		}		   
  }
  if(Waittimeout == 0)
    return 1 ;
	Lenght = HL_BufferToInit(&rx1Buf[2]) ;
	if(Lenght == 0x00)/*判断数据长度*/
	  return 1 ;
	for(j=0;j<Lenght+7;j++)
	{ 
//	printf("rx1Buf[%d]=%x\r\n",j,rx1Buf[j]);
	}
	if(rx1Buf[0]==0x07 && rx1Buf[1]==0x10)	 //表示正确
	{ 	
		if(rx1Buf[7]==0x00)/*是否应答命令*/
		{
		  return 0 ;
		}
		else
		  return 1 ;
//  if(rx1Buf[7]==0x24)/*交易流水号（终端流水）重复*/
//	{	 
//     return 1 ;
//	}  
	}
  return 0 ;
}

 /*******************************************************************************
* 函数名称:HexToChar 		assert_hex_u8print															
* 描	述:写入SD卡数据显示转换																  																			
* 输	入:char																	  
* 输	出:char																  
* 返	回:char 															  
* 修改日期:2014年4月14日			MrLAO														
*******************************************************************************/ 

unsigned char HexToChar(unsigned char byTemp)  
{  
    byTemp &= 0x0f;  
    if(byTemp >= 10)     // show 'A' - 'F'   
   {  
       byTemp = byTemp - 0xa + 0x41;  
   }  
   else        // show '0' - '9'   
   {  
       byTemp = byTemp + 0x30;  
   }  
   return(byTemp);  
}  
void assert_hex_u8print(unsigned char byte)  
{  
    Temple_Data[0] = HexToChar((byte & 0xf0) >> 4);  
    Temple_Data[1] = HexToChar(byte & 0x0f);  
    Temple_Data[2] = 0;  
} 

/*******************************************************************************/ 
void WriteToSD_data(void)
{
  uint8_t  i ;
/**********交易流水号*********/
  WriteDatatoSD(data_hche);
  WriteDatatoSD(data_LS1);
  WriteDatatoSD(data_LS2);
  WriteDatatoSD(data_LS3);
  WriteDatatoSD(data_LS4);
  WriteDatatoSD(data_LS5);
  WriteDatatoSD(data_LS6);
  for(i=15;i<22;i++)
  {
   assert_hex_u8print(Record_buffer[i]);  
   WriteDatatoSD(Temple_Data);
  }
  /**********餐品编号*********/
  WriteDatatoSD(data_null);
  WriteDatatoSD(data_ID1);
  WriteDatatoSD(data_ID2);
  WriteDatatoSD(data_ID3);
  WriteDatatoSD(data_ID4);
  WriteDatatoSD(data_LS6);
  for(i=53;i<57;i++)
  {
   assert_hex_u8print(Record_buffer[i]); 
   WriteDatatoSD(Temple_Data);
  }
 /**********餐品数量*********/
  WriteDatatoSD(data_null);
  WriteDatatoSD(data_NB1);
  WriteDatatoSD(data_NB2);
  WriteDatatoSD(data_NB3);
  WriteDatatoSD(data_NB4);
  WriteDatatoSD(data_LS6);
  assert_hex_u8print(Record_buffer[60]); 
  WriteDatatoSD(Temple_Data);
   /**********餐品价格*********/
  WriteDatatoSD(data_null);
  WriteDatatoSD(data_PR1);
  WriteDatatoSD(data_PR2);
  WriteDatatoSD(data_PR3);
  WriteDatatoSD(data_PR4);
   WriteDatatoSD(data_LS6);
  for(i=90;i<92;i++) //for(i=87;i<93;i++)
  {
   assert_hex_u8print(Record_buffer[i]);  
   WriteDatatoSD(Temple_Data);
  }
 /**********支付方式*********/
   WriteDatatoSD(data_null);
   WriteDatatoSD(data_PS1);
   WriteDatatoSD(data_PS2);
   WriteDatatoSD(data_PS3);
	WriteDatatoSD(data_PS4);
	WriteDatatoSD(data_LS6);
	
    if(Record_buffer[96]=='1')
    {
      WriteDatatoSD(data_PS5);
	  WriteDatatoSD(data_PS6);
	}	
	else if(Record_buffer[96]=='2')
	{
	  WriteDatatoSD(data_PS7);
	  WriteDatatoSD(data_PS8);
	  WriteDatatoSD(data_PS9);
	}
	else if(Record_buffer[96]=='3')
	{
	  WriteDatatoSD(data_PS10);
	  WriteDatatoSD(data_PS11);
	  WriteDatatoSD(data_PS12);
	}
	else if(Record_buffer[96]=='4')
	{
	  WriteDatatoSD(data_PS12);
	  WriteDatatoSD(data_PS13);
	}
	else
	{
	}

	WriteDatatoSD(data_null);
/**********找零金额*********/
  WriteDatatoSD(data_null);
  WriteDatatoSD(data_ZL1);
  WriteDatatoSD(data_ZL2);
  WriteDatatoSD(data_ZL3);
  WriteDatatoSD(data_ZL4);
  WriteDatatoSD(data_LS6);
  for(i=103;i<105;i++) //for(i=100;i<106;i++)
  {
   assert_hex_u8print(Record_buffer[i]);  
   WriteDatatoSD(Temple_Data);
  }
/**********剩余数量*********/
  WriteDatatoSD(data_null);
  WriteDatatoSD(data_SY1);
  WriteDatatoSD(data_SY2);
  WriteDatatoSD(data_SY3);
  WriteDatatoSD(data_SY4);
  WriteDatatoSD(data_LS6);
  for(i=109;i<111;i++)
  {
   assert_hex_u8print(Record_buffer[i]);  
   WriteDatatoSD(Temple_Data);
  }
 /**********交易时间*********/
  WriteDatatoSD(data_null);
  WriteDatatoSD(data_TM1);
  WriteDatatoSD(data_TM2);
  WriteDatatoSD(data_TM3);
  WriteDatatoSD(data_TM4);
  WriteDatatoSD(data_LS6);
  for(i=15;i<17;i++)    //for(i=15;i<21;i++)
  {
   assert_hex_u8print(Record_buffer[i]);  //年
   WriteDatatoSD(Temple_Data);
  }
   //WriteDatatoSD(tim1);	
   assert_hex_u8print(Record_buffer[17]);  //月
   WriteDatatoSD(Temple_Data);
   //WriteDatatoSD(tim1);	
   assert_hex_u8print(Record_buffer[18]);  //日
   WriteDatatoSD(Temple_Data);
   WriteDatatoSD(tim2);
   
   assert_hex_u8print(Record_buffer[19]);  //时
   WriteDatatoSD(Temple_Data);
   WriteDatatoSD(data_LS6);	
   assert_hex_u8print(Record_buffer[20]);  //分
   WriteDatatoSD(Temple_Data);
   WriteDatatoSD(data_LS6);	
   assert_hex_u8print(Record_buffer[21]);  //秒
   WriteDatatoSD(Temple_Data);
  
   
}


   /*******************************************************************************
 * 函数名称:DataUpload                                                                 
 * 描    述:数据上传                                                                  
 *                                                                               
 * 输    入:无                                                                     
 * 输    出:无                                                                     
 * 返    回:void                                                               
 * 修改日期:2014年4月4日                                                                    
 *******************************************************************************/ 
void DataUpload(void)
{
	MealArr(UserAct.MealID);
	/*发送取餐数据给服务器*/
	memset(Record_buffer,0,1024);    
	Record_buffer[1012] = 'L' ;
	Record_buffer[1013] = 'e' ; 
	Record_buffer[1014] = 'n' ;
	Record_buffer[1015] = 'g' ;  
	Record_buffer[1016] = 'h' ;
	Record_buffer[1017] = 't' ;
	Record_buffer[1018] = ':' ; 
	if(TakeMealsFun(Record_buffer) == 0x01) //表示发送失败
	{
		//改变当前最后两位为N0
	}

	WriteToSD_data();
}
